SaitovSP/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВСпискеВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <comment>Сотрудник, с которым связан пользователь</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ОбновитьДанныеПользователяИБ(ПользовательИБ)
	
	ПользовательИБ.Имя = Наименование;
	ПользовательИБ.ПолноеИмя = ПолноеИмя; 
	ПользовательИБ.Пароль = Пароль; 
	ПользовательИБ.ПоказыватьВСпискеВыбора = ПоказыватьВСпискеВыбора;
	
	ПользовательИБ.Роли.Очистить();
	Если ДополнительныеСвойства.Свойство("СписокРолей") Тогда
		
		СписокРолей = ДополнительныеСвойства.СписокРолей;
		Для каждого РольЭлемент Из СписокРолей Цикл      
			
			Если РольЭлемент.Пометка = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРоли = РольЭлемент.Значение;
			ПользовательИБ.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
			
		КонецЦикла;
	
	КонецЕсли;
	
	ПользовательИБ.Записать();       
	
КонецПроцедуры

				
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	 
	Если ЭтоНовый() Тогда
		
		НайденныйПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
		Если НайденныйПользователь = Неопределено Тогда
			
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			ОбновитьДанныеПользователяИБ(ПользовательИБ);		
			
			ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В списке уже есть пользователь с таким именем!";
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;           
		
	Иначе  
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			ОбновитьДанныеПользователяИБ(ПользовательИБ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
